CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/memory_manager/src/sl_memory_manager.c
      // Initialize final metadata of found block.
      allocated_blk->length = (uint16_t)SLI_BLOCK_LEN_BYTE_TO_DWORD(size_real);
      allocated_blk->offset_neighbour_prev = current_block_metadata->offset_neighbour_prev;
      allocated_blk->offset_neighbour_next = new_free_blk->offset_neighbour_prev;

      // Update head pointers. See Note #1.
      if (sli_free_lt_list_head == old_block_metadata) {
        sli_free_lt_list_head = new_free_blk;
      }
      if (sli_free_st_list_head == old_block_metadata) {
        sli_free_st_list_head = new_free_blk;
      }
    } else {
      // Create a new block = allocated block returned to requester. This new block is the nearest to the heap end.
      allocated_blk = (sli_block_metadata_t *)((uint8_t *)current_block_metadata + block_size_remaining);

      sli_memory_metadata_init(allocated_blk);
      allocated_blk->length = (uint16_t)SLI_BLOCK_LEN_BYTE_TO_DWORD(size_adjusted);
      allocated_blk->offset_neighbour_prev = (uint16_t)SLI_BLOCK_LEN_BYTE_TO_DWORD(block_size_remaining);

      if (current_block_metadata->offset_neighbour_next != 0) {
        sli_block_metadata_t *next_blk = (sli_block_metadata_t *)((uint64_t *)current_block_metadata + (current_block_metadata->offset_neighbour_next));

        allocated_blk->offset_neighbour_next = (uint16_t)SLI_BLOCK_LEN_BYTE_TO_DWORD(size_adjusted + SLI_BLOCK_METADATA_SIZE_BYTE);
        next_blk->offset_neighbour_prev = allocated_blk->offset_neighbour_next;
      } else {
        allocated_blk->offset_neighbour_next = 0; // end of heap.
      }

      // Update original found block which becomes a free block.
      new_free_blk = current_block_metadata;
      new_free_blk->length = (uint16_t)SLI_BLOCK_LEN_BYTE_TO_DWORD(block_size_remaining - SLI_BLOCK_METADATA_SIZE_BYTE);
      new_free_blk->offset_neighbour_next = allocated_blk->offset_neighbour_prev;
      // new_free_blk->offset_neighbour_prev doesn't change. It points to the right previous block.

      // Data payload alignment for short-term is managed during the first-fit algorithm loop
      // at the beginning of this function.

      // When the found block is split for ST, the newly created block becomes the allocated block
      // returned to the requester. In that case, the remaining part is already pointed by
      // the ST header pointer and is the first free block to consider for the next allocation.
      // Thus no need to update the ST header pointer. ST head pointer is always the same when the
      // block is split. LT head pointer is left untouched for ST block allocation with split.
    }

    allocated_blk->block_in_use = true;
    // Account for the split block that is free.
    sli_free_blocks_number++;
  } else {
    // Verify if alignment adjustment is required.
    old_block_metadata = allocated_blk;
    if (type == BLOCK_TYPE_SHORT_TERM) {
      const void *data_payload = (void *)((uint8_t *)allocated_blk + SLI_BLOCK_METADATA_SIZE_BYTE);
      is_aligned = SLI_ADDR_IS_ALIGNED(data_payload, block_align);
    }
    if (!is_aligned) {
      allocated_blk = memory_manage_data_alignment(allocated_blk, block_align);
    }

    // Initialize final metadata of found block that was not split.
    // Other metadata members (length and offsets to previous/next) are already correctly set.
    allocated_blk->block_in_use = true; // This setting must be done prior to calling sli_memory_find_head_free_block().

    // Update head pointers accordingly.
    if (sli_free_blocks_number != 0) {
      // There is at least one other free block in the heap.
      if (sli_free_lt_list_head == old_block_metadata) {
        sli_free_lt_list_head = sli_memory_find_head_free_block(BLOCK_TYPE_LONG_TERM, allocated_blk);
      }
      if (sli_free_st_list_head == old_block_metadata) {
        sli_free_st_list_head = sli_memory_find_head_free_block(BLOCK_TYPE_SHORT_TERM, allocated_blk);
      }
    } else {
      // No more free blocks.
      sli_free_lt_list_head = NULL;
      sli_free_st_list_head = NULL;
    }
  }

  heap_size += size_adjusted;
  if (heap_size > heap_high_watermark) {
    heap_high_watermark = heap_size;
  }

  CORE_EXIT_ATOMIC();

  *block = (void *)((uint8_t *)allocated_blk + SLI_BLOCK_METADATA_SIZE_BYTE);

#ifdef SL_CATALOG_MEMORY_PROFILER_PRESENT
#if SL_MEMORY_PROFILER_SELECTION == SL_MEMORY_PROFILER_SILABS
  // Preserve this order else the host-side will not record the events correctly.
  SL_MEMORY_PROFILER_TRACK_ALLOC_WITH_OWNERSHIP(sl_cmm_heap_tracker, allocated_blk, size_real + SLI_BLOCK_METADATA_SIZE_BYTE, sl_memory_profiler_get_return_address());
  SL_MEMORY_PROFILER_TRACK_ALLOC_WITH_OWNERSHIP(sl_cmm_heap_malloc_tracker, *block, size, sl_memory_profiler_get_return_address());

  if (type == BLOCK_TYPE_LONG_TERM) {
    SL_MEMORY_PROFILER_TRACK_ALLOC_WITH_OWNERSHIP(sl_cmm_heap_malloc_lt_tracker, *block, size, sl_memory_profiler_get_return_address());
  } else if (type == BLOCK_TYPE_SHORT_TERM) {
    SL_MEMORY_PROFILER_TRACK_ALLOC_WITH_OWNERSHIP(sl_cmm_heap_malloc_st_tracker, *block, size, sl_memory_profiler_get_return_address());
  }
#endif

#if SL_MEMORY_PROFILER_SELECTION == SL_MEMORY_PROFILER_SYSTEMVIEW
  allocated_blk->block_type = type;
  uint32_t tag = (uint32_t)__builtin_extract_return_addr(__builtin_return_address(0));
  tag |= type << 31U;
  if (type == BLOCK_TYPE_LONG_TERM) {
    SEGGER_SYSVIEW_HeapAllocEx((void*)HEAP_LT_ID, *block, size, tag);
  } else if (type == BLOCK_TYPE_SHORT_TERM) {
    SEGGER_SYSVIEW_HeapAllocEx((void*)HEAP_ST_ID, *block, size, tag);
  }
#endif
#endif

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Frees a previously allocated block back into the heap. Simple version.
 ******************************************************************************/
void sl_free(void *ptr)
{
  (void)sl_memory_free(ptr);
}

/***************************************************************************//**
 * Frees a dynamically allocated block of memory.
 *
 * @note (1) According to IEEE Std 1003.1-2017 (Open Group Base Specifications
 *           Issue 7, 2018 edition), if ptr is a null pointer, no action shall
 *           occur.
 *
 * @note (2) There is no distinction between long-term (LT) and short-term (ST)
 *           blocks when freeing. The free operation is the same for both block
 *           types. Merging adjacent blocks is the same also. The only exception
 *           is the LT and ST head pointers. They must be updated accordingly
 *           with  the freed block. The freed block can be a LT or ST block at
 *           the next allocation.
 ******************************************************************************/
sl_status_t sl_memory_free(void *block)
{
  sl_memory_region_t heap_region = sl_memory_get_heap_region();

#ifdef SL_CATALOG_MEMORY_PROFILER_PRESENT
// We place tracking at the top to track failure too.
#if SL_MEMORY_PROFILER_SELECTION == SL_MEMORY_PROFILER_SILABS
  SL_MEMORY_PROFILER_TRACK_FREE(sl_cmm_heap_malloc_tracker, block);
#endif
#endif

  if (block == NULL) {
    return SL_STATUS_NULL_POINTER;  // See Note #1.
  }

#ifdef SL_CATALOG_MEMORY_MANAGER_PROFILER_PRESENT
#if SL_MEMORY_PROFILER_SELECTION == SL_MEMORY_PROFILER_SILABS
  SL_MEMORY_PROFILER_TRACK_FREE(sl_cmm_heap_tracker, ((uint8_t *)block - SLI_BLOCK_METADATA_SIZE_BYTE));
#endif
#endif

  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_ATOMIC();

