CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/memory_manager/src/sl_memory_manager.c
  sli_block_metadata_t *current_metadata = (sli_block_metadata_t *)((uint8_t *)block - SLI_BLOCK_METADATA_SIZE_BYTE);
  uint16_t total_size_free_block = current_metadata->length + SLI_BLOCK_METADATA_SIZE_DWORD;
  sli_block_metadata_t *free_block = current_metadata;
  sli_block_metadata_t *next_block = NULL;

  // Update counter with block being freed.
  sli_free_blocks_number++;

  // Check if previous block exists and is free.
  if (current_metadata->offset_neighbour_prev > 0) {
    sli_block_metadata_t *metadata_prev_blk = (sli_block_metadata_t *)((uint64_t *)current_metadata - current_metadata->offset_neighbour_prev);

    if (!metadata_prev_blk->block_in_use && !current_metadata->heap_start_align) {
      // Merge current block to free with previous adjacent block.
      free_block = metadata_prev_blk;
      total_size_free_block += metadata_prev_blk->length + SLI_BLOCK_METADATA_SIZE_DWORD;

      // 2 free blocks have been merged, account for 1 free block only.
      sli_free_blocks_number--;
    } else if (current_metadata->heap_start_align) {
      // Special block whose data payload was aligned near heap start. Merge process is special as between
      // the heap start and the block metadata, there is a lost zone to be merged. But at heap start, there is
      // no valid metadata. A new valid metadata will exist after this special merge.
      free_block = metadata_prev_blk;
      total_size_free_block += current_metadata->offset_neighbour_prev;
      current_metadata->heap_start_align = false;
      free_block->offset_neighbour_prev = 0; // heap start.
    } // Else previous block is in used, nothing to merge.
  }

  // Check if next block exists and is free.
  if ((current_metadata->offset_neighbour_next > 0)
      && (((size_t)current_metadata + SLI_BLOCK_LEN_DWORD_TO_BYTE(current_metadata->offset_neighbour_next)) < ((size_t)heap_region.addr + heap_region.size))) {
    next_block = (sli_block_metadata_t *)((uint64_t *)current_metadata + (current_metadata->offset_neighbour_next));

    if (!next_block->block_in_use) {
      // Merge block with next adjacent block.
      total_size_free_block += next_block->length + SLI_BLOCK_METADATA_SIZE_DWORD;
      // Invalidate the next block metadata.
      next_block->length = 0;
      // Get the "next" block adjacent to the invalidated next block.
      next_block = (next_block->offset_neighbour_next == 0) ? NULL : ((sli_block_metadata_t *)((uint64_t *)next_block + (next_block->offset_neighbour_next)));

      // 2 free blocks have been merged, account for 1 free block only.
      sli_free_blocks_number--;
    }
  }

  // Invalidate the block being freed.
  current_metadata->block_in_use = 0;
  current_metadata->length = 0;

  // Update accordingly the metadata block considered as free.
  free_block->length = total_size_free_block - SLI_BLOCK_METADATA_SIZE_DWORD;
  free_block->block_in_use = 0;
  if (next_block != NULL) {
    // Update implicit double linked-list.
    free_block->offset_neighbour_next = (uint16_t)SLI_BLOCK_LEN_BYTE_TO_DWORD((size_t)next_block - (size_t)free_block);
    next_block->offset_neighbour_prev = free_block->offset_neighbour_next;
  } else {
    free_block->offset_neighbour_next = 0;  // Next block is the heap end.
  } // free_block->offset_neighbour_prev does not change.

  // Update free list heads. See Note #2.
  if (sli_free_lt_list_head == NULL             // LT list is empty. Freed block becomes the new 1st element.
      || sli_free_lt_list_head > free_block     // LT list not empty. Verify if freed block becomes the head.
      || sli_free_lt_list_head->length == 0) {
    sli_free_lt_list_head = free_block;
  }

  if (sli_free_st_list_head == NULL             // ST list is empty. Freed block becomes the new 1st element.
      || sli_free_st_list_head < free_block     // ST list not empty. Verify if freed block becomes the head.
      || sli_free_st_list_head->length == 0) {
    sli_free_st_list_head = free_block;
  }

  heap_size -= total_size_free_block;

  CORE_EXIT_ATOMIC();

#ifdef SL_CATALOG_MEMORY_PROFILER_PRESENT
#if SL_MEMORY_PROFILER_SELECTION == SL_MEMORY_PROFILER_SYSTEMVIEW
  if (current_metadata->block_type == BLOCK_TYPE_LONG_TERM) {
    SEGGER_SYSVIEW_HeapFree((void*)HEAP_LT_ID, block);
  } else if (current_metadata->block_type == BLOCK_TYPE_SHORT_TERM) {
    SEGGER_SYSVIEW_HeapFree((void*)HEAP_ST_ID, block);
  }
#endif
#endif

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Dynamically allocates a block of memory cleared to 0. Simple version.
 ******************************************************************************/
void *sl_calloc(size_t item_count,
                size_t size)
{
  void *block_avail = NULL;

  (void)sl_memory_calloc(item_count, size, BLOCK_TYPE_LONG_TERM, &block_avail);

  return block_avail;
}

/***************************************************************************//**
 * Dynamically allocates a block of memory cleared to 0.
 ******************************************************************************/
sl_status_t sl_memory_calloc(size_t item_count,
                             size_t size,
                             sl_memory_block_type_t type,
                             void **block)
{
  size_t block_size;
  sl_status_t status = SL_STATUS_OK;

  // Verify that the block pointer isn't NULL.
  if (block == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  *block = NULL; // No block allocated yet.

  if ((size == 0) || (item_count == 0)) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Calculate block size to allocate.
  block_size = item_count * size;

  // Allocate block.
  status = sl_memory_alloc(block_size, type, block);

  if ((status == SL_STATUS_OK) && (*block != NULL)) {
    // Clear block to zeros.
    memset(*block, 0, block_size);
  }

  return status;
}

/***************************************************************************//**
 * Resize a previously allocated memory block. Simple version.
 ******************************************************************************/
void *sl_realloc(void *ptr,
                 size_t size)
{
  void *block_avail = NULL;

