CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/memory_manager/src/sl_memory_manager.c
        // At this point, current block data payload do not need to be copied. See Note #2.

        // Current block has been extended. Its payload must be returned to the caller.
        *block = ptr;
      } else {
        // Next block cannot fulfill the extension. Get a new one from the heap.
        find_new_block = true;
      }
    } else {
      // Current block is the last heap's block. No possible adjacent extension.
      // Get a new one from the heap.
      find_new_block = true;
    }

    if (find_new_block == true) {
      CORE_EXIT_ATOMIC();

      // Allocate a new block.
      status = sl_memory_alloc(size_real, BLOCK_TYPE_LONG_TERM, block);
      if (status != SL_STATUS_OK) {
        return status;
      }

      CORE_ENTER_ATOMIC();
      // Copy data from current block to new block. See Note #2.
      memcpy(*block, ptr, current_block_len);
      CORE_EXIT_ATOMIC();

      // Free current block. Reallocated block is different from the current one.
      status = sl_memory_free(ptr);

      CORE_ENTER_ATOMIC();
    }

    heap_size += size_real - current_block_len;
    if (heap_size > heap_high_watermark) {
      heap_high_watermark = heap_size;
    }

    // BLOCK REDUCTION.
  } else if (size_real < current_block_len) {
    size_t current_block_remaining_len = current_block_len - size_real;
    bool create_new_block = false;

    if (current_block->offset_neighbour_next != 0) {
      next_block = (sli_block_metadata_t *)((uint64_t *)current_block + (current_block->offset_neighbour_next));

      // Verify if next block is free to merge the newly unallocated portion of the current block.
      if (next_block->block_in_use == 0) {
        // Compute adjusted adjacent free block location.
        sli_block_metadata_t *adjusted_next_block = (sli_block_metadata_t *)((uint8_t *)current_block + SLI_BLOCK_METADATA_SIZE_BYTE + size_real);

        // Update all relevant metadata fields of current block, next block, next next block (if applicable).
        current_block->length = (uint16_t)SLI_BLOCK_LEN_BYTE_TO_DWORD(size_real);
        current_block->offset_neighbour_next = current_block->length + SLI_BLOCK_METADATA_SIZE_DWORD;
        sli_memory_metadata_init(adjusted_next_block);
        adjusted_next_block->length = (uint16_t)SLI_BLOCK_LEN_BYTE_TO_DWORD(current_block_remaining_len) + next_block->length;
        adjusted_next_block->offset_neighbour_prev = current_block->offset_neighbour_next;
        if (next_block->offset_neighbour_next != 0) {
          sli_block_metadata_t *next_next_block = (sli_block_metadata_t *)((uint64_t *)next_block + next_block->offset_neighbour_next);

          adjusted_next_block->offset_neighbour_next = adjusted_next_block->length + SLI_BLOCK_METADATA_SIZE_DWORD;
          next_next_block->offset_neighbour_prev = adjusted_next_block->offset_neighbour_next;
        } else {
          adjusted_next_block->offset_neighbour_next = 0; // End of heap
        }
        // Ensure old next block metadata is invalid.
        sli_memory_metadata_init(next_block);

        // Update head pointers accordingly.
        if (sli_free_blocks_number != 0) {
          // There is at least one other free block in the heap.
          sli_free_lt_list_head = sli_memory_find_head_free_block(BLOCK_TYPE_LONG_TERM, adjusted_next_block);
          sli_free_st_list_head = sli_memory_find_head_free_block(BLOCK_TYPE_SHORT_TERM, adjusted_next_block);
        } else {
          // No more free blocks.
          sli_free_lt_list_head = NULL;
          sli_free_st_list_head = NULL;
        }
      } else {
        // Next block is in use and cannot be merged with the newly unallocated portion.
        create_new_block = true;
      }
    } else {
      // Current block is the last heap's block. No possible adjacent block to merge with the newly unallocated portion.
      create_new_block = true;
    }

    // Try to create a new free block in the unallocated portion of the current block.
    if (create_new_block == true) {
      if (current_block_remaining_len >= SLI_BLOCK_ALLOCATION_MIN_SIZE) {
        // Compute adjusted adjacent free block location.
        sli_block_metadata_t *adjusted_next_block = (sli_block_metadata_t *)((uint8_t *)current_block + SLI_BLOCK_METADATA_SIZE_BYTE + size_real);

        // Update all relevant metadata fields of current block, next block, next next block (if applicable).
        current_block->length = (uint16_t)SLI_BLOCK_LEN_BYTE_TO_DWORD(size_real);
        current_block->offset_neighbour_next = current_block->length + SLI_BLOCK_METADATA_SIZE_DWORD;
        sli_memory_metadata_init(adjusted_next_block);
        adjusted_next_block->length = (uint16_t)SLI_BLOCK_LEN_BYTE_TO_DWORD(current_block_remaining_len);
        adjusted_next_block->offset_neighbour_prev = current_block->offset_neighbour_next;
        if ((next_block != NULL) && (next_block->offset_neighbour_next != 0)) {
          sli_block_metadata_t *next_next_block = (sli_block_metadata_t *)((uint64_t *)next_block + next_block->offset_neighbour_next);

          adjusted_next_block->offset_neighbour_next = adjusted_next_block->length + SLI_BLOCK_METADATA_SIZE_DWORD;
          next_next_block->offset_neighbour_prev = adjusted_next_block->offset_neighbour_next;
        } else {
          adjusted_next_block->offset_neighbour_next = 0; // End of heap
        }

        sli_free_blocks_number++;
        // Update head pointers accordingly.
        if (sli_free_blocks_number != 0) {
          // There is at least one other free block in the heap.
          sli_free_lt_list_head = sli_memory_find_head_free_block(BLOCK_TYPE_LONG_TERM, adjusted_next_block);
          sli_free_st_list_head = sli_memory_find_head_free_block(BLOCK_TYPE_SHORT_TERM, adjusted_next_block);
        } else {
          // No more free blocks.
          sli_free_lt_list_head = NULL;
          sli_free_st_list_head = NULL;
        }
      } else {
        // Not enough space in current block remaining area to create a new free block.
        // consider the current block unallocated portion as lost for now until the current block is freed.
        // In that case, no need to update the current block metadata. All remains the same.
      }
    }

    // Current block has been reduced. Its payload must be returned to the caller.
    *block = ptr;

    heap_size -= current_block_len - size_real;
  } else {
    // If the size requested does not provoke a block extension or reduction, consider no error.
    // And return the same given address.
    *block = ptr;
  }

  CORE_EXIT_ATOMIC();

