CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/memory_manager/src/sl_memory_manager.c
  return status;
}

/***************************************************************************//**
 * Populates an sl_memory_heap_info_t structure with the current status of the heap.
 ******************************************************************************/
sl_status_t sl_memory_get_heap_info(sl_memory_heap_info_t *heap_info)
{
  sl_memory_region_t heap_region = sl_memory_get_heap_region();
  sli_block_metadata_t *block_metadata = (sli_block_metadata_t *)heap_region.addr;
  bool compute = true;
  size_t remaining_size = 0u;
  size_t used_size = 0u;
  size_t free_block_count = 0u;
  size_t used_block_count = 0u;
  size_t largest_free_size = 0u;
  size_t smallest_free_size = SIZE_MAX;
  size_t largest_used_size = 0u;
  size_t smallest_used_size = SIZE_MAX;

  if (heap_info == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_ATOMIC();

  do {
    // Calculate the different used and remaining heap sizes.
    if (block_metadata->block_in_use == 0) {
      remaining_size += SLI_BLOCK_LEN_DWORD_TO_BYTE(block_metadata->length);
      largest_free_size = SL_MAX(SLI_BLOCK_LEN_DWORD_TO_BYTE(block_metadata->length), largest_free_size);
      smallest_free_size = SL_MIN(SLI_BLOCK_LEN_DWORD_TO_BYTE(block_metadata->length), smallest_free_size);
      free_block_count++;
    } else {
      used_size += SLI_BLOCK_LEN_DWORD_TO_BYTE(block_metadata->length);
      largest_used_size = SL_MAX(SLI_BLOCK_LEN_DWORD_TO_BYTE(block_metadata->length), largest_used_size);
      smallest_used_size = SL_MIN(SLI_BLOCK_LEN_DWORD_TO_BYTE(block_metadata->length), smallest_used_size);
      used_block_count++;
    }

    // Get the next block.
    if (block_metadata->offset_neighbour_next == 0) {
      compute = false;
    } else {
      block_metadata = (sli_block_metadata_t *)((uint64_t *)block_metadata + (block_metadata->offset_neighbour_next));
    }
  } while (compute);

  CORE_EXIT_ATOMIC();

  heap_info->base_addr = (size_t)heap_region.addr;
  heap_info->total_size = heap_region.size;
  heap_info->used_size = used_size;
  heap_info->free_size = remaining_size;
  heap_info->free_block_count = free_block_count;
  heap_info->free_block_largest_size = largest_free_size;
  heap_info->free_block_smallest_size = smallest_free_size;
  heap_info->used_block_count = used_block_count;
  heap_info->used_block_largest_size = largest_used_size;
  heap_info->used_block_smallest_size = smallest_used_size;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Gets the size of the heap.
 ******************************************************************************/
size_t sl_memory_get_total_heap_size(void)
{
  sl_memory_heap_info_t heap_info;

  sl_memory_get_heap_info(&heap_info);

  return heap_info.total_size;
}

/***************************************************************************//**
 * Gets the current free heap size.
 ******************************************************************************/
size_t sl_memory_get_free_heap_size(void)
{
  sl_memory_heap_info_t heap_info;

  sl_memory_get_heap_info(&heap_info);

  return heap_info.free_size;
}

/***************************************************************************//**
 * Gets the current used heap size.
 ******************************************************************************/
size_t sl_memory_get_used_heap_size(void)
{
  sl_memory_heap_info_t heap_info;

  sl_memory_get_heap_info(&heap_info);

  return heap_info.used_size;
}

/***************************************************************************//**
 * Gets heap high watermark.
 ******************************************************************************/
size_t sl_memory_get_heap_high_watermark(void)
{
  size_t heap_high_watermark_value = 0;
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_ATOMIC();
  heap_high_watermark_value = heap_high_watermark;
  CORE_EXIT_ATOMIC();
  return heap_high_watermark_value;
}

/***************************************************************************//**
 * Reset heap high watermark to the current heap used.
 ******************************************************************************/
void sl_memory_reset_heap_high_watermark(void)
{
  sl_memory_heap_info_t heap_info;

  sl_memory_get_heap_info(&heap_info);
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_ATOMIC();
  heap_high_watermark = heap_info.used_size;
  CORE_EXIT_ATOMIC();
}

/*******************************************************************************
 ***************************   LOCAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * Manage the required data alignment by moving the non-aligned block payload
 * to the closest aligned location.
 *
 * @param[in]  current_block_metadata   Pointer to block whose payload start
 *                                      address must be moved to be aligned.
 *
 * @param[in]  block_align              Alignment required, in bytes.
 *
 * @return     Pointer to the new block with the correct alignment.
 *
 ******************************************************************************/
static sli_block_metadata_t *memory_manage_data_alignment(sli_block_metadata_t *current_block_metadata,
                                                          size_t block_align)
{
  void *data_payload = (void *)((uint8_t *)current_block_metadata + SLI_BLOCK_METADATA_SIZE_BYTE);
  sli_block_metadata_t *old_block_metadata = current_block_metadata;
  uint16_t align_offset;

  // Align payload to the correct alignment.
  data_payload = (void *)SLI_ALIGN_ROUND_UP(((uintptr_t)data_payload), block_align);

  // Get the new metadata location and update all relevant fields.
  current_block_metadata = (sli_block_metadata_t *)((uint8_t *)data_payload - SLI_BLOCK_METADATA_SIZE_BYTE);
  sli_memory_metadata_init(current_block_metadata);
  align_offset = (uint16_t)((uint64_t *)current_block_metadata - (uint64_t *)old_block_metadata);
  current_block_metadata->length = old_block_metadata->length - align_offset;

  current_block_metadata->offset_neighbour_prev = old_block_metadata->offset_neighbour_prev + align_offset;
  if (old_block_metadata->offset_neighbour_prev != 0) {
    sli_block_metadata_t *prev_block = (sli_block_metadata_t *)((uint64_t *)old_block_metadata - old_block_metadata->offset_neighbour_prev);

    prev_block->offset_neighbour_next = current_block_metadata->offset_neighbour_prev;
    // Merge lost space because of the alignment into the previous block. It helps to keep
    // all computations in malloc()/free() valid. For ST split block, the lost space is back into
    // a free block space.
    prev_block->length += align_offset;
  } else {
    // Special case where the block data payload being aligned is at the heap start. A special flag in the block metadata
    // is used to identify this special block in sl_memory_free() and accordingly perform the merge with previous adjacent block.
    current_block_metadata->heap_start_align = true;
  }

  if (old_block_metadata->offset_neighbour_next != 0) {
    sli_block_metadata_t *next_block = (sli_block_metadata_t *)((uint64_t *)old_block_metadata + old_block_metadata->offset_neighbour_next);

    current_block_metadata->offset_neighbour_next = old_block_metadata->offset_neighbour_next - align_offset;
    next_block->offset_neighbour_prev = current_block_metadata->offset_neighbour_next;
  } else {
    current_block_metadata->offset_neighbour_next = 0;
  }

  return current_block_metadata;
}
